app/views/users/_lists.html.erb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1  ORDER BY created_at ASC  [["user_id", 2]]
---

<% current_user.lists.ordered.each do |list| %>