app/controllers/lists_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @list ||= List.find_by(id: params[:id], opened: true)

INSERT INTO "lists" ("title", "opened", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Programming languages to learn"], ["opened", "t"], ["user_id", 1], ["created_at", "2015-03-25 00:40:32.568924"], ["updated_at", "2015-03-25 00:40:32.568924"]]
---
  def create
    @list = current_user.lists.new(list_params)

    if @list.save

INSERT INTO "favorites" ("list_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["list_id", 8], ["user_id", 11], ["created_at", "2015-03-25 01:19:09.069941"], ["updated_at", "2015-03-25 01:19:09.069941"]]
---
  def favorite
    @favorite_list = Favorite.new(list_id: params[:id], user: current_user)

    if @favorite_list.save!

SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = $1 AND "lists"."id" = $2 LIMIT 1  [["user_id", 1], ["id", 2]]
---
    def set_list
      @list = current_user.lists.find_by_id(params[:id])