app/controllers/tasks_controller.rb

	def create
		@task = @list.tasks.create(tasks_params)
---
INSERT INTO "tasks" ("description", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Ruby"], ["list_id", 2], ["created_at", "2015-03-24 03:00:36.506897"], ["updated_at", "2015-03-24 03:00:36.506897"]]

	  def set_list
	  	@list = List.find(params[:list_id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 2]]