app/controllers/users/favorites_controller.rb

DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 2]]
---
  def destroy
    if @favorite.destroy

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."list_id" = $2 LIMIT 1  [["user_id", 6], ["list_id", 4]]
---
    def set_favorite
      @favorite = current_user.favorites.find_by(list_id: params[:id])